backend/controllers/CoursewareController.php

    public function actionEdit()
    {
        $id = Yii::$app->request->get('id');
        $model = Courseware::findOne($id);
---
SELECT * FROM `courseware` WHERE `id`='4175'